# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
# import libraries here
import numpy as np
import pandas as pd
import matplotlib.pyplot as alt

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [2]:
# your answer here

df = pd.read_csv('Employee.csv')
df

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [3]:
# your answer here-1st way

df.pivot_table(index = 'Department').head()

            Salary     Years
Department
HR           45.00  4.666667
IT           48.75  4.500000
Sales        55.00  2.500000

In [4]:
# your answer here-2nd way
df.groupby(by = 'Department').mean().head()

               Years  Salary
Department
HR          4.666667   45.00
IT          4.500000   48.75
Sales       2.500000   55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [5]:
# your answer here

df.pivot_table(index = 'Department', columns = 'Gender').head()

           Salary       Years
Gender          F     M     F         M
Department
HR           52.5  30.0   6.0  2.000000
IT           30.0  55.0   2.0  5.333333
Sales        55.0  55.0   2.0  3.000000

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [6]:
# your answer here
df.pivot_table(index =['Title'], values = ['Years', 'Salary']).head()

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [7]:
# your answer here

df.pivot_table(index = 'Title', aggfunc = {
    'Name' : 'count',
    'Salary' : 'mean'
}).head()

           Name     Salary
Title
VP            2  70.000000
analyst       4  32.500000
associate     3  56.666667

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [8]:
# your answer here

df.pivot_table(index = ['Title', 'Department'], aggfunc = {
    'Salary' : ['median', 'min', 'max', 'std']
}).head()

                     Salary
                        max median   min       std
Title     Department
VP        HR           70.0   70.0  70.0       NaN
          IT           70.0   70.0  70.0       NaN
analyst   HR           35.0   32.5  30.0  3.535534
          IT           35.0   32.5  30.0  3.535534
associate IT           60.0   60.0  60.0       NaN

#### Based on your comments, fill the missing values with an appropriate value

In [9]:
# your answer here
df.pivot_table(index = ['Title', 'Department'],
               fill_value = 0,
               aggfunc = {
    'Salary' : ['median', 'min', 'max', 'std']
}).head()

                     Salary
                        max median min       std
Title     Department
VP        HR             70   70.0  70  0.000000
          IT             70   70.0  70  0.000000
analyst   HR             35   32.5  30  3.535534
          IT             35   32.5  30  3.535534
associate IT             60   60.0  60  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [10]:
# your answer here
df.pivot_table(
    index = 'Department',
    aggfunc = {
        'Salary' : 'sum',
        'Name' : 'count'
    }
               
).head()

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [11]:
# your answer here

df.pivot_table(
    index = ['Department', 'Title'],
    aggfunc = {
        'Years' : 'sum',
        'Salary' : 'mean'
    }
               
).head()

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [14]:
# your answer here--Your custom function here
df_no_max_salary = df[df['Salary'] != df['Salary'].max()]
df_no_max_salary

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

In [17]:
# your answer here
df_no_max_salary.pivot_table(
    index = 'Department',
    values = 'Salary'
)

               Salary
Department
HR          32.500000
IT          41.666667
Sales       55.000000

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [18]:
# your answer here
df_2 = pd.read_csv('Fitbit.csv')
df_2

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
0,08-05-2015,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417
1,09-05-2015,3631,18925,14.11,4,611.000,316,61,60,2248,454,35,21,491
2,10-05-2015,3204,14228,10.57,1,602.000,226,14,77,1719,387,46,25,436
3,11-05-2015,2673,6756,5.02,8,749.000,190,23,4,9620,311,31,21,350
4,12-05-2015,2495,502,3.73,1,876.000,171,0,0,7360,407,65,44,491
5,13-05-2015,276,779,5.79,15,726.000,172,34,18,1094,405,47,31,457
6,14-05-2015,2687,5614,4.17,2,782.000,216,13,1,9830,381,28,12,415
7,15-05-2015,2793,8169,6.07,14,801.000,218,8,7,1092,269,34,16,306
8,16-05-2015,4061,19971,14.84,18,532.000,247,101,118,27,452,26,18,507
9,17-05-2015,3349,852,6.33,12,606.000,186,46,73,1766,269,17,11,291
10,18-05-2015,2961,11998,8.91,20,936.000,189,18,51,1371,167,9,8,180
11,19-05-2015,2911,12425,9.23,14,827.000,186,18,54,1351,368,50,27,420
12,20-05-2015,2569,6008,4.46,8,783.000,214,15,2,9390,386,30,22,420
13,21-05-2015,3228,16291,12.10,18,616.000,237,48,52,1766,351,46,26,399
14,22-05-2015,2529,6111,4.54,8,820.000,190,14,5,8820,314,32,26,353
15,23-05-2015,4197,17928,13.32,17,533.000,262,79,132,288,432,35,24,469
16,24-05-2015,3899,13893,10.32,6,641.000,222,33,140,2502,224,24,19,270
17,25-05-2015,2519,5109,3.80,8,861.000,200,0,0,8470,0,0,0,0
18,26-05-2015,2357,443,3.29,6,1.269,156,0,0,6440,389,39,28,430
19,27-05-2015,3209,7498,5.57,18,692.000,196,64,50,1676,381,24,17,412
20,28-05-2015,2811,849,6.31,14,771.000,212,8,13,1148,417,66,32,486
21,29-05-2015,2558,565,4.20,8,789.000,208,0,0,8900,464,35,26,503
22,30-05-2015,417,21479,15.98,16,503.000,230,55,153,2794,328,53,25,382
23,31-05-2015,3533,18995,14.11,12,660.000,269,86,43,2092,426,54,33,495
24,01-06-2015,3354,16836,12.51,8,586.000,248,35,70,1862,430,41,26,484
25,02-06-2015,3369,15944,11.85,29,640.000,214,15,93,1827,376,46,34,436
26,03-06-2015,3168,14273,10.60,11,721.000,178,16,89,1592,312,44,29,369
27,04-06-2015,347,1606,11.93,11,724.000,239,38,70,1939,388,21,15,415
28,05-06-2015,3134,13594,10.10,16,677.000,215,36,52,1583,409,56,34,468
29,06-06-2015,3436,1548,11.50,11,520.000,246,78,42,1927,426,54,27,495
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
337,08-04-2016,3241,13441,10.04,2,449.000,439,0,0,1874,379,46,24,425
338,09-04-2016,3038,10216,7.59,0,535.000,390,0,0,1607,507,18,10,525
339,10-04-2016,2304,5634,4.19,0,921.000,92,41,4,6590,306,35,22,341
340,11-04-2016,3419,17422,13.38,34,674.000,290,14,61,1928,407,50,26,457
341,12-04-2016,3179,14475,10.92,14,664.000,291,10,47,1696,354,37,21,391
342,13-04-2016,3427,17777,13.66,20,696.000,276,10,80,1967,365,65,31,430
343,14-04-2016,3479,19087,14.65,17,711.000,221,12,96,1954,278,26,18,304
344,15-04-2016,3501,1629,12.20,12,467.000,427,25,11,2166,396,50,20,446
345,16-04-2016,3342,14252,10.64,6,675.000,323,60,18,1947,404,67,25,471
346,17-04-2016,2769,8262,6.14,3,1.089,302,0,0,1266,0,0,0,0
347,18-04-2016,3486,1945,15.06,18,860.000,190,6,98,1926,307,28,12,335
348,19-04-2016,3596,17232,13.61,17,1.002,262,4,88,2085,0,0,0,0
349,20-04-2016,3321,16946,12.93,25,762.000,238,5,67,1795,411,31,17,442
350,21-04-2016,3464,19183,14.67,24,723.000,218,7,97,1964,341,27,17,368
351,22-04-2016,3328,12963,9.66,10,404.000,436,14,10,202,430,62,39,492
352,23-04-2016,2612,6456,4.80,6,782.000,305,0,0,1135,305,42,28,348
353,24-04-2016,2863,10413,7.73,6,700.000,269,28,24,1411,375,56,31,431
354,25-04-2016,3175,10499,7.80,0,661.000,430,9,4,1805,237,28,14,265
355,26-04-2016,3357,17226,12.97,19,751.000,185,16,95,1798,360,20,10,380
356,27-04-2016,3631,19784,15.51,25,694.000,151,26,128,207,361,49,27,410
357,28-04-2016,403,25571,19.30,15,606.000,293,42,129,2711,374,56,34,430
358,29-04-2016,3442,17528,13.36,15,594.000,239,8,82,1931,348,20,9,368
359,30-04-2016,3061,9831,7.30,1,561.000,414,0,0,1651,454,48,27,502
360,01-05-2016,3331,14262,10.60,5,666.000,361,21,41,1937,347,41,20,388
361,02-05-2016,2989,13236,9.98,12,770.000,234,8,38,1477,314,34,23,348
362,03-05-2016,3796,18588,14.13,16,599.000,275,49,79,236,377,33,18,410
363,04-05-2016,3525,16382,12.39,16,684.000,333,10,55,2075,406,21,8,427
364,05-05-2016,3649,21913,16.40,19,701.000,287,29,90,2249,280,35,15,315
365,06-05-2016,3539,19023,14.79,15,575.000,298,8,85,2112,370,42,22,412
366,07-05-2016,304,9526,7.08,2,564.000,370,13,10,1604,502,57,31,563

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [19]:
# your answer here
df_2.describe()

,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
count,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000,367.000000
mean,2741.501362,10121.588556,8.549128,11.724796,563.934482,236.405995,26.163488,35.722071,2044.147139,290.479564,28.008174,16.196185,321.343324
std,916.307036,5594.836225,3.409881,10.337370,294.793145,86.531376,20.319456,31.006682,2041.267168,154.752328,18.541415,10.757622,170.786726
min,179.000000,0.000000,0.000000,0.000000,1.002000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2698.000000,6730.500000,6.155000,5.000000,520.000000,179.000000,8.000000,10.500000,1218.500000,224.000000,14.000000,7.000000,248.000000
50%,2974.000000,10413.000000,8.290000,11.000000,663.000000,226.000000,24.000000,29.000000,1553.000000,337.000000,29.000000,16.000000,370.000000
75%,3233.000000,13916.500000,10.560000,16.000000,756.500000,290.000000,41.500000,54.000000,1927.500000,400.500000,41.500000,24.000000,440.500000
max,4351.000000,26444.000000,20.450000,101.000000,998.000000,472.000000,101.000000,153.000000,9830.000000,553.000000,78.000000,45.000000,607.000000

In [24]:
# your answer here
df_2.dtypes

Date                       object
Calorie burned              int64
Steps                       int64
Distance                  float64
Floors                      int64
Minutes Sedentary         float64
Minutes Lightly Active      int64
Minutes Fairly Active       int64
Minutes Very Active         int64
Activity Calories           int64
MinutesOfSleep              int64
MinutesOfBeingAwake         int64
NumberOfAwakings            int64
LengthOfRestInMinutes       int64
dtype: object

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [25]:
# your answer here
df_2['Minutes Very Active'].corr(df_2['Steps'])

0.5714518481062608

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [26]:
# your answer here
plt.scatter(
    x = df_2['Minutes Very Active'],
    y = df_2['Steps']
)

NameError: name 'plt' is not defined

#### What can you say about Minute Very Active and Steps? Write a comment below

In [19]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [20]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [21]:
# your answer here

In [22]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [23]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [24]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [25]:
# your answer here

In [26]:
#Print cor_fit

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [27]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [28]:
# your answer here

In [29]:
#Print time_grades

#### Show visually the frequency distribution of the time_grades dataset.

In [30]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [31]:
# your answer here-Pearson

In [32]:
## your answer here-Spearman

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [33]:
# your answer here

In [34]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [35]:
#your comment here